Repository: m-ahsan-bilal/swipe-clean-gallery
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: Swipe Clean Gallery
ur: سوائپ کلین گیلری

# splashTitle
source: Swipe Clean Gallery
ur: سوائپ کلین گیلری

# splashSubtitle
source: Swipe to organize your memories
ur: اپنی یادوں کو منظم کرنے کے لیے سوائپ کریں

# splashSwipeHint
source: Swipe to clean
ur: صاف کرنے کے لیے سوائپ کریں

# languageSelectionTitle
source: Choose Your Language
ur: اپنی زبان منتخب کریں

# languageSelectionSubtitle
source: Select your preferred language to continue
ur: جاری رکھنے کے لیے اپنی پسندیدہ زبان منتخب کریں

# continueButton
source: Continue
ur: جاری رکھیں

source: Permission Required
ur: اجازت درکار ہے

source: Access Your Photos
ur: اپنی تصاویر تک رسائی

# permissionDeniedMessage
source: This app requires full access to your photos and storage to function. Without permission, you cannot use the app. Please tap the button below to grant access in Settings.
ur: اس ایپ کو کام کرنے کے لیے آپ کی تصاویر اور اسٹوریج تک مکمل رسائی کی ضرورت ہے۔ اجازت کے بغیر، آپ اس ایپ کو استعمال نہیں کر سکتے۔ براہ کرم سیٹنگز میں رسائی دینے کے لیے نیچے بٹن دبائیں۔

# permissionMessage
source: Photo Swipe needs permission to view and manage photos on your device. Swipe to browse, swipe up to delete.
ur: فوٹو سوائپ کو آپ کے ڈیوائس پر تصاویر دیکھنے اور منظم کرنے کی اجازت کی ضرورت ہے۔ براؤز کرنے کے لیے سوائپ کریں، حذف کرنے کے لیے اوپر سوائپ کریں۔

# appCannotBeUsed
source: App cannot be used without permission
ur: اجازت کے بغیر ایپ استعمال نہیں ہو سکتی

source: Allow Access
ur: رسائی کی اجازت دیں

source: Open Settings
ur: سیٹنگز کھولیں

source: Full Access Required
ur: مکمل رسائی درکار ہے

# fullAccessMessage
source: This app requires full photo access to function properly. Please grant full access in Settings.
ur: اس ایپ کو صحیح طریقے سے کام کرنے کے لیے مکمل تصاویر کی رسائی کی ضرورت ہے۔ براہ کرم سیٹنگز میں مکمل رسائی دیں۔

source: OK
ur: ٹھیک ہے

# enableAllFilesAccess
source: Please enable "All files access" in Settings to use this app
ur: اس ایپ کو استعمال کرنے کے لیے براہ کرم سیٹنگز میں "تمام فائلوں تک رسائی" فعال کریں

source: Your Photos
ur: آپ کی تصاویر

# loadingPhotos
source: Loading your photos...
ur: آپ کی تصاویر لوڈ ہو رہی ہیں...

source: No photos found
ur: کوئی تصاویر نہیں ملیں

source: Gallery refreshed
ur: گیلری تازہ ہو گئی

# errorLoadingGallery
source: Error loading gallery: {error}
ur: گیلری لوڈ کرنے میں خرابی: {error}

source: Exit Gallery
ur: گیلری سے باہر نکلیں

# exitWithoutCleaningMessage
source: You're leaving without cleaning. Come back soon!
ur: آپ صاف کیے بغیر جا رہے ہیں۔ جلد واپس آئیں!

source: Cancel
ur: منسوخ کریں

source: Exit
ur: باہر نکلیں

# filesDeleted
source: {count} file{plural} successfully deleted
ur: {count} فائل{plural} کامیابی سے حذف ہو گئی

# freedUpSpace
source: You've freed up space! Continue or exit?
ur: آپ نے جگہ خالی کر لی ہے! جاری رکھیں یا باہر نکلیں؟

source: Keep Cleaning
ur: صاف کرتے رہیں

source: Settings
ur: سیٹنگز

source: Language
ur: زبان

source: Change Language
ur: زبان تبدیل کریں

source: Current Language
ur: موجودہ زبان

source: Select Language
ur: زبان منتخب کریں

# languageChanged
source: Language changed successfully
ur: زبان کامیابی سے تبدیل ہو گئی

source: System Default
ur: سسٹم ڈیفالٹ

source: Recently Deleted
ur: حال ہی میں حذف شدہ

source: Delete
ur: حذف کریں

source: Restore
ur: بحال کریں

source: Delete Forever
ur: ہمیشہ کے لیے حذف کریں

source: Confirm
ur: تصدیق کریں

# deleteConfirmation
source: Are you sure you want to delete this item?
ur: کیا آپ واقعی اس آئٹم کو حذف کرنا چاہتے ہیں؟

# permanentDeleteConfirmation
source: This action cannot be undone. Are you sure?
ur: یہ عمل کالعدم نہیں ہو سکتا۔ کیا آپ کو یقین ہے؟

# itemRestored
source: Item restored successfully
ur: آئٹم کامیابی سے بحال ہو گیا

# itemDeleted
source: Item deleted permanently
ur: آئٹم مستقل طور پر حذف ہو گیا

source: Today
ur: آج

source: Yesterday
ur: کل

source: This Week
ur: اس ہفتے

source: This Month
ur: اس ماہ

source: January
ur: جنوری

source: February
ur: فروری

source: March
ur: مارچ

source: April
ur: اپریل

source: May
ur: مئی

source: June
ur: جون

source: July
ur: جولائی

source: August
ur: اگست

source: September
ur: ستمبر

source: October
ur: اکتوبر

source: November
ur: نومبر

source: December
ur: دسمبر

# daysAgo
source: {count} days ago
ur: {count} دن پہلے

# weeksAgo
source: {count} week{plural} ago
ur: {count} ہفتے{plural} پہلے

# monthsAgo
source: {count} month{plural} ago
ur: {count} ماہ{plural} پہلے

source: Select All
ur: سب منتخب کریں

source: Deselect All
ur: سب غیر منتخب کریں

# selectedCount
source: selected
ur: منتخب

source: Restore Selected
ur: منتخب کو بحال کریں

source: Delete Selected
ur: منتخب کو حذف کریں

source: Empty Trash
ur: ٹریش خالی کریں

source: No deleted items
ur: کوئی حذف شدہ آئٹمز نہیں

# deletedItemsMessage
source: Deleted items will be kept for 30 days
ur: حذف شدہ آئٹمز 30 دنوں تک رکھے جائیں گے

# confirmRestore
source: Restore {count} item{plural}?
ur: {count} آئٹم{plural} بحال کریں؟

# confirmDelete
source: Permanently delete {count} item{plural}?
ur: {count} آئٹم{plural} مستقل طور پر حذف کریں؟

# confirmEmptyTrash
source: Empty trash?
ur: ٹریش خالی کریں؟

# confirmEmptyTrashMessage
source: This will permanently delete all {count} items. This action cannot be undone.
ur: یہ تمام {count} آئٹمز کو مستقل طور پر حذف کر دے گا۔ اس عمل کو کالعدم نہیں کیا جا سکتا۔

# itemsRestored
source: {count} item{plural} restored
ur: {count} آئٹم{plural} بحال ہو گئے

# itemsDeleted
source: {count} item{plural} deleted permanently
ur: {count} آئٹم{plural} مستقل طور پر حذف ہو گئے

# trashEmptied
source: Trash emptied successfully
ur: ٹریش کامیابی سے خالی ہو گیا

source: Image deleted
ur: تصویر حذف ہو گئی

source: Video deleted
ur: ویڈیو حذف ہو گئی

source: Deleted successfully
ur: کامیابی سے حذف ہو گیا

source: Restored successfully
ur: کامیابی سے بحال ہو گیا

# errorOccurred
source: An error occurred
ur: ایک خرابی پیش آئی

source: Swipe up to delete
ur: حذف کرنے کے لیے اوپر سوائپ کریں

source: Release to delete
ur: حذف کرنے کے لیے چھوڑ دیں

# deletingImage
source: Deleting...
ur: حذف ہو رہا ہے...

source: Photo
ur: تصویر

source: Video
ur: ویڈیو

# outOf
source: of
ur: میں سے

source: Delete this item?
ur: اس آئٹم کو حذف کریں؟

# deleteItemMessage
source: This item will be moved to recently deleted
ur: یہ آئٹم حال ہی میں حذف شدہ میں منتقل ہو جائے گا

source: Close
ur: بند کریں

source: Done
ur: مکمل

# unableToPlayVideo
source: Unable to play video: {error}
ur: ویڈیو چلانے میں ناکام: {error}

source: Clear All
ur: سب صاف کریں

# noMoreCards
source: You've reached the end
ur: آپ آخر تک پہنچ چکے ہیں

# queueEmpty
source: No items queued for deletion
ur: حذف کرنے کے لیے کوئی آئٹم منتخب نہیں

source: Yes
ur: ہاں

source: No
ur: نہیں

# onboardingWelcomeTitle
source: Welcome to SnapBin Gallery
ur: SnapBin Gallery میں خوش آمدید

# onboardingWelcomeSubtitle
source: Your smart, animated gallery experience.
ur: آپ کا ذہین اور متحرک گیلری کا تجربہ۔

# onboardingSwipeTitle
source: Explore Your Gallery
ur: اپنی گیلری دریافت کریں

# onboardingSwipeSubtitle
source: Swipe left or right to browse through your images and videos.
ur: اپنی تصاویر اور ویڈیوز دیکھنے کے لیے بائیں یا دائیں سوائپ کریں۔

# onboardingDeleteTitle
source: Swipe Up to Delete
ur: حذف کرنے کے لیے اوپر سوائپ کریں

# onboardingDeleteSubtitle
source: A paper-fold animation sends your file to the bin — fast, clean, and fun!
ur: کاغذ موڑنے والی اینیمیشن آپ کی فائل کو بین میں بھیجتی ہے — تیز، صاف اور دلچسپ!

# onboardingOrganizeTitle
source: Manage with a Tap
ur: ایک ٹپ پر منظم کریں

# onboardingOrganizeSubtitle
source: Tap the bin icon to review or delete items permanently.
ur: آئٹمز کا جائزہ لینے یا مستقل طور پر حذف کرنے کے لیے بین آئیکون پر ٹیپ کریں۔

# onboardingSkip
source: Skip
ur: اسکپ کریں

# onboardingNext
source: Next
ur: اگلا

# onboardingDone
source: Get Started
ur: شروع کریں

source: Theme
ur: تھیم

# themeModeLabel
source: Theme mode
ur: تھیم موڈ

# themeDark
source: Dark mode
ur: ڈارک موڈ

# themeLight
source: Light mode
ur: لائٹ موڈ

source: About
ur: ہمارے بارے میں

# aboutAppName
source: SwipeClean Gallery
ur: سوائپ کلین گیلری

# aboutVersion
source: Version {version}
ur: ورژن {version}

# aboutDescription
source: SwipeClean Gallery is designed to make cleaning up your media library effortless. Swipe through your photos and videos with fluid animations, queue up deletions, and enjoy celebratory effects when you clear space.
ur: سوائپ کلین گیلری آپ کی میڈیا لائبریری کو صاف کرنے کو آسان بنانے کے لیے ڈیزائن کی گئی ہے۔ روانی انیمیشن کے ساتھ اپنی تصاویر اور ویڈیوز کے ذریعے سوائپ کریں، حذف کرنے کے لیے قطار میں لگائیں، اور جب آپ جگہ صاف کرتے ہیں تو جشن کے اثرات سے لطف اندوز ہوں۔

# aboutKeyFeatures
source: Key Features
ur: اہم خصوصیات

# aboutFeature1
source: Tinder-style card stack to browse media one item at a time.
ur: ایک وقت میں ایک میڈیا آئٹم براؤز کرنے کے لیے ٹنڈر طرز کا کارڈ اسٹیک۔

# aboutFeature2
source: Swipe gestures for quick navigation and satisfying deletion animations.
ur: تیز نیویگیشن اور اطمینان بخش حذف کرنے کی انیمیشنز کے لیے سوائپ اشارے۔

# aboutFeature3
source: Localized experience with support for multiple languages and right-to-left layouts.
ur: متعدد زبانوں اور دائیں سے بائیں ترتیب کی حمایت کے ساتھ مقامی تجربہ۔

# aboutFeature4
source: Customizable themes so you can pick between light and dark modes.
ur: حسب ضرورت تھیمز تاکہ آپ ہلکے اور گہرے موڈز میں سے انتخاب کر سکیں۔

# aboutClosing
source: We built SwipeClean Gallery to combine performance, accessibility, and a bit of delight. Thank you for trying it out!
ur: ہم نے کارکردگی، رسائی، اور تھوڑی سی خوشی کو یکجا کرنے کے لیے سوائپ کلین گیلری بنائی۔ اسے آزمانے کا شکریہ!
